{
  "iNumThreads": "Number of threads to use with the game. Edit at your own risk. No proof this actually does anything",
  "bDisablePlayerCollision": "Probably some sort of No-Clip. Needs testing",
  "bSimpleLighting": "Enables simple lighting. Will probably increase performance and lower lighting quality. Needs Testing",
  "fSunShadowUpdateTime": "How long it takes shadows to move to their new position when the sun position updates. Lower = smoother transitions",
  "fSunUpdateThreshold": "How often the Sun position updates. Lower = Faster",
  "bEnableVolumetricLighting": "Enables volumetric lighting. Probably costs a lot of CPU if this command still works. Would look great in VR though. Needs Testing",
  "fTAAPostSharpen": "Increase/decrease the sharpening effect while using TAA",
  "bDrawShadows": "Enable or disables shadows. May increase performance. Probably looks bad",
  "bCharacterLighting": "Enable or disable character lighting. Probably looks more realistic with it turned off. Needs testing",
  "bShadowsOnGrass": "Toggles the ability of objects to cast shadows upon grass. The grass itself does not cast shadows. This may be disabled for a minor performance increase.",
  "bTreesReceiveShadows": "Toggles the ability of trees to cast shadows on themselves. It may be disabled for a slight performance gain.",
  "bAllowShaderCache": "Probably enables or disables the shader cache, if it works at all. Needs testing",
  "bUseSunBeams": "Possibly related to God rays? Needs testing",
  "fDecalLifetime": "How long Decals remain in a game",
  "iVRWindowSize": "Sets the size of the VR Window on your desktop. Not sure if this is a x or y value",
  "bDoRadialBlur": "Enables or disables depth of field",
  "fVrScale": "Scale of your player in VR. Higher makes you more of a giant (not just height but relative size). A lot of people set this to 75-76",
  "bForceImmortal": "Probably gives you God mode when enabled? Needs testing",
  "bForceGodMode": "Another god mode command? See: bForceImmortal. Not sure if there is a difference",
  "fSneakEnterThreshold": "The percentage of your height before considered sneaking. Lower = You have to crouch lower to activate. Setting to 0 probably makes it where you are never in sneak mode while crouching",
  "fSneakExitThreshold": "The percentage of your height before your player leaves sneak mode. Higher = You have to stand higher to exit sneaking",
  "bAllowVRCheating": "Lets you lean into objects without being kicked back. Feels more immersive when turned on",
  "bDebugAlwaysShowWands": "Setting to 1 always shows your controllers in game",
  "bVRPauseOnControllerDisconnect": "Turn this off to prevent the game from pausing when one of your controllers turns off",
  "bPauseOnVROverlay": "Disabling this will keep your game running while you open the vr overlay",
  "fGunRotation": "Changes the rotation of your gun, a common request for people to fine tune the angle they hold the gun at. Try 60-65",
  "fSkyScaleFactor": "Alters star field distance (users report 1000-2000 is a good distance)",
  "bBorderRegionsEnabled": "Turn this off to be able to walk past the map invisible borders. Use with caution",
  "bDisableAllGore": "Turn off gore, maybe good if you want kids to try this out or you don\u0027t like seeing blood",
  "bAlwaysActive": "Disable this (Set to 0) if you want the game to pause if another window is in front",
  "uGridsToLoad": "Don\u0027t mess with this. It causes issues. It determines how many cells around your player to load. Will corrupt your save if you edit this midgame",
  "iNumHWThreads": "How many threads the game uses. No real proof that editing this value does anything at all",
  "fComfortModeVignetteHardness": "Change this value to make the vignette fade in more or less (lower = gradual fade to black)",
  "bFadeWorldWhenMenuIsOpen": "Fade the game world when you open a menu, or leave it clear. Needs to be tested",
  "fMapVrDirectMovementSpeed": "Probably how fast you can direct move in VR? Value is pretty height, might not even do anything. Needs testing",
  "fLockScale": "Scale of the lock while lock picking. Make the value bigger to make the lock bigger",
  "fLockPositionZ": "Z location of the lock while picking",
  "fLockPositionY": "Y location of the lock while picking",
  "fLockPositionX": "X Position of the lock while picking",
  "fHUDCompassScale": "Size of the compass. Heigher number = bigger compass",
  "sHUDCompassModel": "Perhaps you can edit this with a custom compass model when a mod is released",
  "fNoteScale": "Probably changes the size of notes when being read. If this works it could make it easier to read in VR. Needs testing",
  "fBookScale": "Probably changes the size of books when being read. If this works it could make it easier to read in VR. Needs testing",
  "bPlayVRMeleeWorldImpactSounds": "Probably enabling this lets you hear the sound of melee impacts when you hit world objects",
  "bUseBulletWaterDisplacements": "Probably shows bullets splashing in water. If turning this off works it could potentially increase performance. Needs testing",
  "bForceHighDetailReflections": "In Fallout 3, this forced more objects to be reflected in the water. Doesn\u0027t appear to be used by this game",
  "bForceLowDetailReflections": "In Fallout 3, this forced less objects to be reflected in the water. Doesn\u0027t appear to be used by this game",
  "bUseWater": "Stops water from rendering. Water still is there and you can swim in it",
  "bShowTutorials": "Enable or Disable Tutorials. 1 = Enabled 0 = Disabled",
  "bShowCrosshair": "Show or hide the crosshair. Not sure if this effects VR or not",
  "bUseWandDirectionalMovement": "Turning this off makes you no longer steer your character using your hands",
  "iConsoleTextSize": "Text size of the developer console",
  "rConsoleTextColor": "RGB Value to change the color of the developer console text",
  "iConsoleSizeScreenPercent": "How much of the screen the developer console takes up (Percentage)",
  "iAutoSaveCount": "How many autosaves before overwrite",
  "bDisableAutoSave": "Enables or disables autosaving. (0 = enabled)",
  "bEnableAudio": "Set to 0 to disable audio. Probably not useful for anyone.",
  "bForceNPCsUseAmmo": "This will force the NPC to use ammo on all guns. 1 = Forced 0 = Disabled",
  "bForceFullDetail": "Force full details of trees. May make the game look prettier at the cost of performance",
  "bEnableTrees": "Toggles the \u0022dynamic\u0022 rendering of trees. If disabled, all trees will be skinned and inanimate, using the \u0022static\u0022 version of tree rendering, which also removes tree popping.",
  "bFogEnabled": "Enable or Disable the Fog weather Effect. 1 = Enabled 0 = Disabled. Could potentially increase performance if disabled",
  "bPrecipitation": "Enable or Disable Rain Weather Effect. 1 = Enabled 0 = Disabled",
  "bBloodSplatterEnabled": "Enables or disables blood splatter on the screen. Might not do anything in VR. Needs testing",
  "uDecalCount": "Total number of decals allowed at once. Could effect performance",
  "uLightCount": "Number of real lights allowed at once. Could effect performance",
  "iShadowMapResolution": "Shadow resolution. Edit in proper intervals (256, 512, 1024, etc)",
  "bUseTAA": "Use TAA post processing. Disabling may increase aliasing but makes the game less fuzzy looking",
  "bFXAAEnabled": "Enables FXAA antialiasing",
  "bGamepadEnabled": "disable this to disable the use of a gamepad for this game",
  "fHUDOpacity": "Transparency of the HUD. 1 = Fully Opaque. 0 = Fully Transparent (Invisible)",
  "bSaveOnPause": "Enable to autosave when the game is paused",
  "bSaveOnTravel": "Enable to autosave when you fast travel",
  "bSaveOnWait": "Enable to autosave when you wait",
  "bSaveOnRest": "Enable to autosave when you sleep",
  "bShowCompass": "Show or Hide the Compass from your UI. 1 = Shown 0 = Hidden",
  "bLeftHandedMode": "Set to 1 to make your character left handed",
  "bDirectMovementWithWands": "Set to 1 to use direct movement instead of teleport",
  "bShowQuestMarkers": "Show or hide quest markers. Needs testing",
  "iDifficulty": "Difficulty of the game. 0 = Easiest -\u003E 5 = Hardest",
  "bComfortSwim": "Enables or disables comfort swimming (motion sickness prevention)",
  "bOneTimeCalibrationCompleted": "Set to 0 if you want to go through the calibration/tutorial again before starting the game",
  "bComfortSneak": "Enables or disables the comfort vignette while sneaking",
  "bRealisticShield": "Not sure what this does to shields, but probably like the bow, probably gives you more control over the shield",
  "bAlwaysRunByDefault": "Set to 1 to always run when pressing forward. Needs testing in VR",
  "bGamePadRumble": "Enable or disables the rumblepad in your controllers",
  "bUseRealisticBowAiming": "Set to 1 to let you control your bow and arrow more. A lot better than the default bow handling",
  "fAutosaveEveryXMins": "How many minutes between autosaves",
  "bComfortModeWhileMoving": "Enables or disables the comfort vignette when moving around",
  "bComfortModeWhileTurning": "Enables or disables the comfort vignette when turning",
  "bDecals": "Enables or disables decals. Turning off could increase performance",
  "uMaxSkinDecals": "How many decals on character skins. Lower could increase performance",
  "uMaxDecals": "Global number of decals that can render at once. Lower could increase performance",
  "fHUDMenuX": "Moves the compass and healthbars across the X axis",
  "fHUDMenuY": "Moves the compass and healthbars across the Y axis",
  "fHUDMenuZ": "Moves the compass and healthbars across the Z axis",
  "bHealthBarShowing": "Show the Enemy Health Bar. 1 = Enabled 0 = Disabled. Doesn\u0027t have any effect in VR so far. Needs more testing",
  "fSunBaseSize": "Sets the sun\u0027s base size. Setting it to 0 will remove the sun altogether, albeit the day will still be lit.",
  "iCompassPosition": "Decides where the compass is located, you can toggle this in the in-game VR Settings. 1 = Above your view, 0 = Below your view",
  "fMaxTime": "Physics refresh rate. Recommended to change to 0.0111. Recommended to change fMaxTimeComplex relative to this value.",
  "fMaxTimeComplex": "Complex Physics refresh rate. Recommended to set this to double the value of fMaxTime",
  "bDoDepthOfField": "Setting to 0 disables UNDERWATER FOG (NOT Depth of field unfortunately)",
  "fMeleeSwingAngularVelocityThreshold": "Sets the sensitivity of a registered swing of a weapon using motion controllers. This is for the primary hand. See \u0027fShieldLinearVelocityThreshold\u0027 for non-primary",
  "fShieldLinearVelocityThreshold": "Recommend setting to 2-4.5. Sets the sensitivity of a registered swing/block of a shield/weapon using motion controllers. This is for your non-primary hand. See \u0027fMeleeSwingAngularVelocityThreshold\u0027 for primary",
  "fMeleeLinearVelocityThreshold": "Recommend setting to 4-6. Sets the sensitivity of a registered melee punch",
  "bFull Screen": "Set this to 1 to make your desktop window full screen. This may increase performance due to how Windows treats fullscreen games vs windowed/borderless",
  "uMaxNumPhysicsStepsPerUpdate": "Set this to 1 to get rid of hiccuping objects",
  "iShadowUpdateFrameDelay": "Set this to 1 to make the shadows stop flickering on 3d movable objects after you edit fMaxTime",
  "fNearDistance": "How close an object needs to be to your view before it dissapears. Setting to a low value like 13 may help with mountains flickering",
  "fMagicRotationPitch": "Sets the angle from your hands that magic projects from. Set to 40-60 depending on where you want it (higher = higher in the hand)",
  "fMagicHandRotate": "Rotates the hand model when you are casting magic",
  "fLeftHandShieldRotationRoll": "Set to -10 to make it easier to move and block with your shield at the same time",
  "fRightHandShieldRotationRoll": "Set to 10 to make it easier to move and block with your shield at the same time",
  "fActivatePickLength": "How close you have to be to an object to grab it. 20 is more immersive",
  "fAutoAimScreenPercentageVROverride": "Set to 0 to turn off the Bow auto aim. Also see \u0027fAutoAimScreenPercentageVR\u0027",
  "fAutoAimScreenPercentageVR": "Set to 0 to turn off the Bow auto aim. Also see \u0027fAutoAimScreenPercentageVROverride\u0027",
  "bImmediatelyGrabObjectOnActivate": "Set this to 0 to remove the pull to character effect when you pick up items.",
  "fVal0": "Volume Control: Fallout(Voice) Skyrim(Effects) Starfield(Unknown?)",
  "fVal1": "Volume Control: Fallout(Music) Skyrim(Footsteps) Starfield(Unknown?)",
  "fVal2": "Volume Control: Fallout(Effects) Skyrim(Voice) Starfield(Unknown?)",
  "fVal3": "Volume Control: Fallout(Footsteps) Skyrim(Music) Starfield(Unknown?)",
  "fVal4": "Volume Control: Fallout(Radio) Skyrim(Unknown?) Starfield(Unknown?)",
  "fVal5": "Volume Control: Fallout(Unassigned) Skyrim(Unassigned) Starfield(Unknown?)",
  "fVal6": "Volume Control: Fallout(Unassigned) Skyrim(Unassigned) Starfield(Unknown?)",
  "fVal7": "Volume Control: Fallout(Unassigned) Skyrim(Unassigned) Starfield(Unknown?)",
  "fDualCastMinDistance": "How far apart your hands must be to dual cast magic. Recommend to set to 20 for a more immersive experience",
  "fMinPulsesForFullSwipe": "changes how many menu items are selected for one swipe across the track pad (minimum)",
  "fMaxPulsesForFullSwipe": "changes how many menu items are selected for one swipe across the track pad (maximum)",
  "fAlternateTriggerThreshold": "If you prefer a hair trigger that you cant keep mashing while its still depressed, set to 0.001",
  "bUseAlternateTriggerThreshold": "Set to 0 to bypass the alternate trigger threshold (search: fAlternateTriggerThreshold)",
  "fDownwardGrabFloorDistanceMultiplier": "Setting this to 0 stops the wands from extending out when the controller is pointed down",
  "fSecondaryWandMaxGrabDistance": "this is ignored by fDownwardGrabFloorDistanceMultiplier when aiming at the floor",
  "fPrimaryWandMaxGrabDistance": "this is ignored by fDownwardGrabFloorDistanceMultiplier when aiming at the floor",
  "bDisableCompositor": "This stops the game from rendering in the headset. You\u0027ll just see the steamVR loading screen. Pretty useless for us",
  "fVrPowerArmorScaleMultiplier": "Scale of your player inside Power Armor. This is a multiplier to fVrScale so only change this if you want to be a lot bigger in Power Armor but not out",
  "bVrShowIntroBink": "Disables the VR intro Video when starting the game",
  "bAutoLoadLastSaveGame": "Setting to 1 will just load the last save game instead of asking you to pick a save",
  "fComfortVignetteSizeMax": "This effects the maximum value for the Vignette when using the in-game slider",
  "fComfortVignetteSizeMin": "This effects the minimum value for the Vignette when using the in-game slider",
  "bInfiniteAmmo": "Probably for giving infinite ammo, but I wasn\u0027t able to get it to work when set to 1",
  "fVrRunSpeedScalar": "Increasing this will increase how fast your character will sprint. May cause vomiting if used incorrectly",
  "fVrStrafeSpeedScalar": "Increasing this will increase how fast your character will straf. May cause vomiting if used incorrectly",
  "bDisableAllSaves": "Disables game saving when set to 1",
  "fWorkbenchScale": "Sets distance AND scale of the floating crafting menu. Don\u0027t set it too high as the menu gets hidden by walls/furniture.",
  "fPrimaryWandHUDZ": "Moves the HUD (ie ammo in your gun) on your primary wand hand on the Z axis in the world (Height Up and down)",
  "fPrimaryWandHUDY": "Moves the HUD (ie ammo in your gun) on your primary wand hand on the Y axis in the world (depth back/forward)",
  "fPrimaryWandHUDX": "Moves the HUD (ie ammo in your gun) on your primary wand hand on the X axis in the world (left to right)",
  "fHUDLootZ": "Changes the location of the Quick Loot HUD on the Z plane in the world (up/down height from your wand)",
  "fHUDLootY": "Changes the location of the Quick Loot HUD on the Y plane in the world (depth from your wand)",
  "fHUDLootX": "Changes the location of the Quick Loot HUD on the X plane in the world (left to right of your wand)",
  "fFavoritesTouchpadCenterButtonPercent": "Sets the proportion (not percent) of the trackpad where a press is considered a center-button press and not a directional press up down left or right.",
  "bInvalidateOlderFiles": "Set this to 1 to allow the loading of loose files in the data\\ folder",
  "sResourceDataDirsFinal": "This can be used to support loading loose folders in the Data directory. This method has been superceeded with bInvalidateOlderFiles",
  "bFootstepSoundsEnabled": "Enables or Disables Footstep sounds. 1 = Enabled 0 = Disabled",
  "fDefaultMasterVolume": "Master Volume Level. Can be \u0027boosted\u0027 by setting higher than 1",
  "bApplyCameraNodeAnimations": "You need to set this to 0 if you are trying to mess with the default camera location for third person.",
  "bDisableAutoVanityMode": "Disables Vanity mode. 1 = Disable 0 = Enable",
  "f1st3rdSwitchDelay": "How long of a delay between switching from 1st to 3rd person. Lower is faster.",
  "f3rdPersonAimFOV": "The ADS field of view when in Third person.",
  "fMouseWheelZoomIncrement": "How much further/closer you move to your player while using the scrollwheel in third person. Lower = Smoother transitions",
  "fMouseWheelZoomSpeed": "How fast zooming occurs when scrolling the mouse to change your distance to your player in third person",
  "fOverShoulderCombatAddY": "Moves the Y axis of the third person Camera while in combat",
  "fOverShoulderCombatPosX": "Moves the X axis of the third person Camera while in combat",
  "fOverShoulderCombatPosZ": "Moves the Z axis of the third person Camera while in combat",
  "fOverShoulderMeleeCombatPosX": "Moves the X axis of the camera while in melee",
  "fOverShoulderMeleeCombatPosZ": "Moves the Z axis of the camera while in melee",
  "fOverShoulderPosX": "Moves the X axis of the third person Camera while not in combat",
  "fOverShoulderPosZ": "Moves the Z axis of the third person Camera while not in combat",
  "fVanityModeMaxDist": "The furthest distance you can zoom out in in vanity mode.",
  "fVanityModeMinDist": "The closest vanity mode can get to your model",
  "bIronSightsZoomEnable": "Enables or Disables Iron sights zooming. 1 = Enabled 0 = Disabled. This hasn\u0027t been tested",
  "fAimDownDegrees": "How many degrees Vertically can you aim. 90 = Directly down.",
  "fAimUpDegrees": "How many degrees Vertically can you aim. 90 = Directly above.",
  "bBackgroundMouse": "Enable this to show the windows Cursor while playing. 1 = Enabled 0 = Disabled",
  "fEnterWorkshopDelay": "How long you have to hold the workshop key to Enter workshop mode",
  "fIronSightsPitchSpeedRatio": "This alters the speed of your mouse while in Iron sights. Set to 1 to disable speed difference.",
  "fMouseHeadingXScale": "Mouse X Axis sensitivity multiplier. Higher makes the mouse move faster Left to Right",
  "fMouseHeadingYScale": "Mouse Y Axis sensitivity multiplier. Higher makes the mouse move faster Up to Down",
  "fPipboyLightDelay": "Sets how long you have to hold the pipboy key to turn on your flashlight",
  "fPitchSpeedRatio": "This is the multiplier that controls Up and down (Y axis) mouse movement. Setting this to 1 will make the sensitivity ratio equal to your X axis",
  "fPowerArmorExitDelay": "How long you must hold the Exit power armor key to trigger",
  "fThrowDelay": "How long you have to hold the bash key to pull the pin of a grenade",
  "fZKeyDelay": "Sets how long you have to hold the use key to pick up an object",
  "uMaxSkinDecalPerActor": "Set this higher for more decals, could effect performance",
  "bShowMarkers": "This will Show or Hide Markers. 1 = Show 0 = Hide",
  "fDecalLOD0": "How far away from the player decals show",
  "fDefault1stPersonFOV": "The Field of view for the Firstperson camera",
  "fDefaultFOV": "This edits the first person FOV. Don\u0027t mess with this in VR",
  "fDefaultWorldFOV": "The Field of view for the third person camera. Set to 80-100 for a better PC experience",
  "fPipboyScreenDiffuseIntensity": "Changes the Brightness of the Pipboy Text/Images",
  "fPipboyScreenDiffuseIntensityPA": "Changes the Brightness of the Pipboy Text/Images while in Power Armor",
  "fPipboyScreenEmitIntensity": "Changes the Brightness of the Pipboy Text/Images",
  "fPipboyScreenEmitIntensityPA": "Changes the Brightness of the Pipboy Text/Images while in Power Armor",
  "iLocation X": "X location for your Game window to appear at. 0 sets it on the default monitor.",
  "iLocation Y": "Y location for your Game window to appear at. 0 sets it on the default monitor.",
  "uiPipboyLightR": "Red color channel for Pipboy Light 0-\u003E255",
  "uiPipboyLightG": "Green color channel for Pipboy Light 0-\u003E255",
  "uiPipboyLightB": "Blue color channel for Pipboy Light 0-\u003E255",
  "uiPowerArmorR": "Red color channel for Power Armor UI (Dont think it works though) 0-\u003E255",
  "uiPowerArmorG": "Green color channel for Power Armor UI (Dont think it works though) 0-\u003E255",
  "uiPowerArmorB": "Blue color channel for Power Armor UI (Dont think it works though) 0-\u003E255",
  "uiPowerArmorLightR": "Red color channel for Power Armor Light 0-\u003E255",
  "uiPowerArmorLightG": "Green color channel for Power Armor Light 0-\u003E255",
  "uiPowerArmorLightB": "Blue color channel for Power Armor Light 0-\u003E255",
  "bEssentialTakeNoDamage": "This lets you kill Essential NPCs. Setting this to 0 can break the game if main quest characters Die!",
  "fPlayerHealthSaveOnPauseLimit": "How much health you must have for the game to perform an autosave. 1 = Full health 0 = no health.",
  "iTerminalLockoutTime": "How long you are locked out of a terminal if you fail to hack it. (In Seconds)",
  "bEnableMainMenuBink": "This Enables or Disables the video on the Main menu. Disabling may make your main menu load faster on slower systems.",
  "bForceUpdateDiffuseOnly": "You must set this to 0 If you mess with the Degrade and Upgrade Texture Distance settings",
  "bPauseOnAltTab": "Set this to 0 to keep the game from pausing when you alt tab",
  "bPlayMainMenuMusic": "Set this to 0 to turn off the main menu music",
  "bUseHardDriveCache": "Set this to 1 if you don\u0027t have enough RAM to keep the game loaded. Could help with performance on weak systems.",
  "fEncumberedReminderTimer": "How often the game reminds you that you are carrying too much. Lower = More reminders",
  "iTextureDegradeDistance0": "The First Tier distance from your player that texture quality degrades (Helps with performance)",
  "iTextureDegradeDistance1": "The Second Tier distance from your player that texture quality degrades (Helps with performance)",
  "iTextureUpgradeDistance0": "The first Tier distance from your player that texture quality Increases",
  "iTextureUpgradeDistance1": "The Second Tier distance from your player that texture quality increases",
  "sIntroMovie": "Use this to specify an Intro Movie File",
  "sIntroSequence": "Sequence of Intro Videos to play. Set this the value \u0027none\u0027 to disable.",
  "sLanguage": "Game Language",
  "sMainMenuMusic": "This selects the music file to play on the main menu",
  "sMenuFocusSoundFile": "Focus Sound Effect file",
  "sMenuCancelSoundFile": "Cancel Sound Effect file",
  "sMenuNewGameSoundFile": "New Game Sound Effect file",
  "sMenuOKSoundFile": "\u0027OK\u0027 Sound Effect file",
  "sStartingConsoleCommand": "Console Command to execute When the game starts",
  "uExterior Cell Buffer": "Outside Cell buffer size. Game doesn\u0027t read any value lower than 47 for some reason. Increase this if yo u increase your uGridsToLoad.",
  "uMainMenuDelayBeforeAllowSkip": "Delay at the main menu before input lets you skip the video. Set to 1 to make it instant. 0 does not work.",
  "iMinGrassSize": "Lower Equals higher Grass Density. May decrease performance. Put higher to lower Grass Density",
  "fBookOpenTime": "How long it takes to open a book in milliseconds. Lower numbers open books faster. The default value opens the book in 1 second",
  "fCrosshairAlphaPercent": "The transparency of the Crosshair. 0% is completely transparent. 100% is completely opaque.",
  "fMaxSubtitleDistance": "How far you can get from an NPC before the subtitles dissapear",
  "fSafeZoneX": "Margin from the edge of the screen (x axis on 4:3) your UI is placed. Lower = Closer",
  "fSafeZoneXWide": "Margin from the edge of the screen (x axis on 16:9) your UI is placed. Lower = Closer",
  "fSafeZoneXWide16x10": "Margin from the edge of the screen (x axis on 16:10) your UI is placed. Lower = Closer",
  "fSafeZoneY": "Margin from the edge of the screen (y axis on 4:3) your UI is placed. Lower = Closer",
  "fSafeZoneYWide": "Margin from the edge of the screen (y axis on 16:9) your UI is placed. Lower = Closer",
  "fSafeZoneYWide16x10": "Margin from the edge of the screen (y axis on 16:10) your UI is placed. Lower = Closer",
  "uConfirmContainerTakeAllMinimumItems": "How many of the same items must be in a container before it asks you to confirm if you want them all",
  "uSubtitleB": "Blue Color Channel for Subtitle text. 0-255",
  "uSubtitleG": "Green Color Channel for Subtitle text. 0-255",
  "uSubtitleR": "Red Color Channel for Subtitle text. 0-255",
  "iPipboyColorB": "Blue Channel color of the Pipboy. 0-255",
  "iPipboyColorG": "Green Channel color of the Pipboy. 0-255",
  "iPipboyColorR": "Red Channel color of the Pipboy. 0-255",
  "bAllowYesToAll": "Lets you select Yes for All if prompted by multiple prompts. 1 = Enabled 0 = Disabled",
  "bBlockMessageBoxes": "Blocks or Allows Message Boxes. 1 = Blocked 0 = Allow",
  "bUseCompanionWarping": "Set this to 0 to stop Companions from Warping to you when they are too far away. 1 = Enable Warping 0 = Disable",
  "bPipboyDisableFX": "Disables all Pipboy Effects. Useful if a mod reskins the pipboy UI. 1 = Disabled FX 0 = Enabled FX",
  "bPipboyEffectColorOnLight": "Set this to 0 to not use the pipboy screen color as your flashlight color.",
  "fVATSRangedLongDistance": "How far away an enemy can be for VATS to work. Higher = Further distances",
  "bReflectSky": "Reflect the sky in the water. 1 = Enabled 0 = Disabled",
  "bUseWaterHiRes": "Use High Resolution water. 1 = Enabled 0 = Disabled",
  "fSunGlareSize": "Changes the size of the glare of the sun. Higher = Bigger",
  "bInfiniteItems": "Possibly will give you infinite Items in workshop mode? Untested. 1 = Enabled",
  "bWorkshopAutoSaveOnExit": "Should the game auto save when you exist Work Shop Mode? 1 = Enabled 0 = Disabled",
  "bWorkshopEnableGridBasedSnapping": "Enable Grid snapping for workshop items. 1 = Enabled 0 = Disabled",
  "fItemHoldDistantSpeed": "How far away an item can be for you to be able to hold it (Higher = Further)",
  "fItemRotationSpeed": "How fast you can rotate an item (higher = faster)",
  "bInvertYValues": "Invert the Gamepad Y Axis. 1 = Enabled 0 = Disabled",
  "fGamepadHeadingSensitivity": "Gamepad sensitivity. Higher = Faster",
  "fMouseHeadingSensitivity": "Mouse Sensitivity. Higher = Faster",
  "bAllowShadowcasterNPCLights": "Enable this to allow NPC lights to cast shadows. ( Will lower performance) 1 = Enabled 0 = Disabled",
  "bBorderless": "Enabled Borderless Mode. 1 = Enabled 0 = Disabled.",
  "bEnableWetnessMaterials": "Enables or disables wetness materials. 1 = Enabled 0 = Disabled",
  "bForceIgnoreSmoothness": "This is a texture setting, not mouse acceleration. Not sure if it really changes much",
  "bMaximizeWindow": "Stretches the window to fit your resolution. (May cause the game to be cut off) 1 = Enabled 0 = Disabled",
  "bSAOEnable": "Enables or Disables Ambient Occlusion. 1 = Enabled 0 = Disabled",
  "bTopMostWindow": "Sets the game to always be on top of all windows. This will prevent you from being able to alt tab on single monitors.",
  "bVolumetricLightingEnable": "Enable or disbale the Volumetric Lighting (May increase performance) 1 = Enabled 0 = Disabled",
  "fBlendSplitDirShadow": "This is the radius of how far shadows will start to decrease in quality (LOD) Lower will decrease performance",
  "fDirShadowDistance": "How far to render shadows. Lower = Better performance",
  "fShadowDistance": "How far away shadows should render. Higher will decrease performance",
  "iMaxAnisotropy": "Sets Anistropic Filtering. 0 2 4 8 16 are the values you should use",
  "iMaxDecalsPerFrame": "Total number of decals to render every frame",
  "iPresentInterval": "This enables or disables Vsync in game. 0 = off 1=on. Some Report 2 works as well.",
  "iSize H": "Height (Y) Resolution Value.",
  "iSize W": "Width (X) Resolution Value.",
  "iVolumetricLightingQuality": "Volumetric Lighting Quality. 0 = Lowest -\u003E 3 = Highest",
  "sAntiAliasing": "Set the AA to use for the game. FXAA or TAA",
  "bShowFloatingQuestMarkers": "Shows or hides Floating quest markers on the compass. 1 = Enabled 0 = Disabled",
  "bPipboyCompanionEnabled": "Enables or disables the Pipboycompanion App. 1 = Enable 0 = Disable",
  "fGrassStartFadeDistance": "This determines how far away from your character you can see grass.",
  "bLensFlare": "Enable or Disable Lens Flare effect. 1 = Enabled 0 = Disabled",
  "bMBEnable": "Enable or Disable Motion Blur Effect. 1 = Enabled 0 = Disabled",
  "bScreenSpaceBokeh": "Enable or Disable Bokeh (High quality motion Blur) 1 = Enabled 0 = Disabled",
  "bDialogueCameraEnable": "Enable or disable the use of the dialogue camera. 1 = Enabled 0 = Disabled",
  "bDialogueSubtitles": "Enable or Disable Dialogue Subtitles. 1 = Enabled 0 = Disabled",
  "bGeneralSubtitles": "Enable or Disable General Subtitles. 1 = Enabled 0 = Disabled",
  "iHUDColorR": "Red Color Channel for the Heads up Display",
  "iHUDColorG": "Green Color Channel for the Heads up Display",
  "iHUDColorB": "Blue Color Channel for the Heads up Display",
  "bEnableFileSelection": "Set this to 1 to enable plugin support in the launcher (may no longer work) 1 = Enable 2 = Disable",
  "bScreenSpaceReflections": "Enable or disable Screenspace Reflections. 1 = Enabled 0 = Disabled",
  "bScreenSpaceSubsurfaceScattering": "Enable or Disable Screenspace Subsurface Scattering. 1 = Enabled 0 = Disabled",
  "fLODFadeOutMultActors": "Fadeout value for Actors. Higher = Further distance",
  "fLODFadeOutMultItems": "Fadeout value for Items. Higher = Further distance",
  "fLODFadeOutMultObjects": "Fadeout value for Objects. Higher = Further distance",
  "fLODFadeOutMultSkyCell": "Fadeout value for Sky cells. Higher = Further distance",
  "bCrosshairEnabled": "Enable or disable the crosshair. 1 = Enabled 0 = Disabled",
  "iMaxDesired": "Max Particles to render",
  "fPipboyEffectColorR": "Pipboy Red Color Channel Value (0-1.0)",
  "fPipboyEffectColorG": "Pipboy Green Color Channel Value (0-1.0)",
  "fPipboyEffectColorB": "Pipboy Blue Color Channel Value (0-1.0)",
  "fModMenuEffectColorR": "Red Color Channel for the Weapon/Armor Modding UI",
  "fModMenuEffectColorG": "Green Color Channel for the Weapon/Armor Modding UI",
  "fModMenuEffectColorB": "Blue Color Channel for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightColorR": "Highlight - Red Channel Color for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightColorG": "Highlight - Green Channel Color for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightColorB": "Highlight - Blue Channel Color for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightPAColorR": "Power Armor Highlight - Red Channel Color for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightPAColorG": "Power Armor Highlight - Green Channel Color for the Weapon/Armor Modding UI",
  "fModMenuEffectHighlightPAColorB": "Power Armor Highlight - Blue Channel Color for the Weapon/Armor Modding UI",
  "bUseWaterDepth": "Enable or Disable Water Depth. 1 = Enabled 0 = Disabled",
  "bUseWaterReflections": "Enables or disables Water Reflections. May help performance on weaker systems. 1 = Enabled 0 = Disabled",
  "fOverShoulderMeleeCombatAddY": "Moves the Y axis of the camera while in melee",
  "fPitchZoomOutMaxDist": "How far you can zoom out while in third person.",
  "iDefaultWaitHours": "Default Hours value when you press the Wait button.",
  "bNVFlexEnable": "Enables NVFlex. 1 = Enabled 0 = Disabled",
  "bNvGodraysEnable": "Turns on/off the God Rays (Nvidia Tech). Might be depreciated (at least in FO4VR)",
  "bEnableRainOcclusion": "Turns on/off the Rain Occlusion. Might be depreciated (at least in FO4VR)",
  "iTexMipMapSkip": "Changing may help with LOD texture pop-in...Might be depreciated (at least in FO4VR)",
  "bEnableVatsWithScopes": "Set to 1 to allow you to use scopes while also using VATS",
  "bEnableRoomscaleMovement": "Set to 1 to let your hitbox move along with your real movements around your playspace. Turn off to go back to a static hitbox",
  "fRoomscaleMovementGradualRealignSpeed": "Probably how fast your hitbox updates to your movements... Needs testing",
  "fArrowSnapDistance": "Lowering this prevents the autonocking of arrows at further distances. Set to 0 to turn off, recommend setting to 1",
  "fArrowLerpDistance": "Lowering this prevents the autonocking of arrows at further distances. Set to 0 to turn off, recommend setting to 1.5",
  "fBowHoldOffsetY": "Changings the grip position on the bow. Recommend changing to -6.6",
  "fActivateRolloverWandScale": "Change the size of activation text. Lower = Smaller",
  "bAlwaysShowHands": "Shows or hides your vr hands on weapons",
  "bRenderSkinnedTrees": "Disables \u0022Skinned trees\u0022 when set to 0. Basically lowers tree quality. May increase performance",
  "fTreeLoadDistance": "How far trees render in. Setting this to 100000 has a low performance cost and a huge visual upgrade",
  "bEnableAutoDynamicResolution": "Set to 0 to turn of the automatica adjustment of in game super sampling (highly recommended)",
  "fRenderTargetSizeMultiplier": "In Game super sampling. 1.0 is no super sampling. This is a multiplier.",
  "bShouldDisableDMInVATS": "Disable Direct Movement while VATS is active. Disable=1 Enable DM=0",
  "fVATSFireWeaponActionPointsMultiplier": "VATS cost multiplier per weapon fire",
  "fUHmdRotationLagMaxDistance": "The farthest away UI elements will get before following the headset",
  "fUHmdRotationLagMinDistance": "The minimum distance UI elements need to be before they will start timing for fUHmdRotationLagDuration to eventually be moved back into view",
  "fUHmdRotationLagDuration": "How long UI elements need to be outside of fUHmdRotationLagMinDistance before they move back into view",
  "fUHmdRotationLagRecoveryAcceleration": "How quickly UI elements accelerate to their fUHmdRotationLagRecoveryMaxSpeed",
  "fUHmdRotationLagRecoveryMaxSpeed": "How quickly UI elements move back into view",
  "bAllowCreateGrass": "Turns on/off grass in the game. 0 = off 1 = on",
  "bAutoWaterSilhouetteReflections": "This is believed to be unused by the game. In testing, no difference was noticed. This setting originates with Fallout 3.",
  "bReflectLODLand": "This toggles land reflections in the water. It is recommended to be enabled.",
  "bAlwaysSaveAllInfo": "This was added with the official 1.2 patch. This default value was changed from 0 (disabled) to 1 (enabled) with the official 1.3 patch.",
  "bDisplayMarkWarning": "This is believed to be unused by the game.",
  "bInitiallyLoadAllClips": "This is believed to be unused by the game.",
  "bSendNonVisibleBehaviorGraphsToSPU": "This is believed to be unused by the game.",
  "fMountDismountTimeout": "This default value was increased from 5 to 8 with the official 1.6 patch. It is assumed this was necessary because of the introduction of mounted combat.",
  "uiMaxNumActorHit": "This is believed to be unused by the game.",
  "bCheckRuntimeCollisions": "This is believed to be unused by the game. It originated with Oblivion.",
  "bTrackFileLoading": "This is believed to be unused by the game.",
  "bUseArchives": "This is believed to be unused by the game. It originated with Oblivion.",
  "iRetainDirectoryStringTable": "This is believed to be unused by the game. It originated with Oblivion.",
  "iRetainFilenameOffsetTable": "This is believed to be unused by the game. It originated with Oblivion.",
  "iRetainFilenameStringTable": "This is believed to be unused by the game. It originated with Oblivion.",
  "sArchiveList": "This is believed to be unused by the game. It originated with Oblivion.",
  "sInvalidationFile": "This is believed to be unused by the game. It originated with Oblivion.",
  "sResourceArchiveListBeta": "This was added with the official 1.6 patch.",
  "bLoadBackgroundFaceGen": "This is believed to be unused by the game.",
  "bUseBackgroundFileLoader": "This is believed to be unused by the game.",
  "bUseMultiThreadedTrees": "This is believed to be unused by the game.",
  "iPostProcessMillisecondsEditor": "This is believed to be unused by the game.",
  "iPostProcessTaskWarningMilliseconds": "This is believed to be unused by the game.",
  "fMaxMsUsagePerFrame": "This is believed to be unused by the game.",
  "fMsActiveRefCount": "This is believed to be unused by the game.",
  "fMsActorRefCount": "This is believed to be unused by the game.",
  "fMsAnimatedObjectsCount": "This is believed to be unused by the game.",
  "fMsDecalCount": "This is believed to be unused by the game.",
  "fMsEmittersCount": "This is believed to be unused by the game.",
  "fMsGeometryCount": "This is believed to be unused by the game.",
  "fMsHavokTriCount": "This is believed to be unused by the game.",
  "fMsLightCount": "This is believed to be unused by the game.",
  "fMsLightExcessGeometry": "This is believed to be unused by the game.",
  "fMsParticlesCount": "This is believed to be unused by the game.",
  "fMsRefCount": "This is believed to be unused by the game.",
  "fMsTriangleCount": "This is believed to be unused by the game.",
  "fMsWaterCount": "This is believed to be unused by the game.",
  "uActiveRefCount": "This is believed to be unused by the game.",
  "uActiveRefCountInterior": "This is believed to be unused by the game.",
  "uActorMemoryBudgetCap": "This is believed to be unused by the game.",
  "uActorRefCount": "This is believed to be unused by the game.",
  "uActorRefCountInterior": "This is believed to be unused by the game.",
  "uAnimatedObjectsCount": "This is believed to be unused by the game.",
  "uAnimatedObjectsCountInterior": "This is believed to be unused by the game.",
  "uCityLODBudgetAdjustment": "This is believed to be unused by the game.",
  "uDecalCountInterior": "This is believed to be unused by the game.",
  "uEmittersCount": "This is believed to be unused by the game.",
  "uEmittersCountInterior": "This is believed to be unused by the game.",
  "uGeometryCount": "This is believed to be unused by the game.",
  "uGeometryCountInterior": "This is believed to be unused by the game.",
  "uGeometryMemory": "This is believed to be unused by the game.",
  "uGeometryMemoryInterior": "This is believed to be unused by the game.",
  "uHavokTriCount": "This is believed to be unused by the game.",
  "uHavokTriCountInterior": "This is believed to be unused by the game.",
  "uLightCountInterior": "This is believed to be unused by the game.",
  "uLightExcessGeometry": "This is believed to be unused by the game.",
  "uLightExcessGeometryInterior": "This is believed to be unused by the game.",
  "uLoadedAreaNonActorMemoryBudgetCap": "This is believed to be unused by the game.",
  "uParticlesCount": "This is believed to be unused by the game.",
  "uParticlesCountInterior": "This is believed to be unused by the game.",
  "uRefCount": "This is believed to be unused by the game.",
  "uRefCountInterior": "This is believed to be unused by the game.",
  "uTextureMemory": "This is believed to be unused by the game.",
  "uTextureMemoryInterior": "This is believed to be unused by the game.",
  "uTriangleCount": "This is believed to be unused by the game.",
  "uTriangleCountInterior": "This is believed to be unused by the game.",
  "uWastelandLODBudgetAdjustment": "This is believed to be unused by the game.",
  "uWaterCount": "This is believed to be unused by the game.",
  "uWaterCountInterior": "This is believed to be unused by the game.",
  "uWaterMemory": "This is believed to be unused by the game.",
  "uWaterMemoryInterior": "This is believed to be unused by the game.",
  "bDragonCameraTargetPlayer": "This was added with the official 1.8 patch.",
  "bReturnTo1stPersonFromVanity": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fAutoVanityIncrement": "This sets the speed at which the vanity camera spins around the player character with values lower than the default reducing the speed and values higher than the default increasing the speed.",
  "fAutoVanityModeDelay": "This sets the the time delay in seconds after which the vanity camera that spins around the player character when idle is shown. With the default value, the vanity camera activates when the player character is inactive for 120 seconds.",
  "fDefaultAutoVanityZoom": "This sets the distance between the vanity camera and player character, with values lower than default zooming in closer to the player character, and values higher than default zooming out farther away from the player character.",
  "fDragonCameraDollyTime": "This was added with the official 1.8 patch.",
  "fDragonMaxAngleBeforeTurn": "This was added with the official 1.8 patch.",
  "fMinCurrentZoom": "This sets the minimum zoom in third person mode.",
  "fMouseWheelZoomMinDelta": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fOverShoulderDragonAddY": "This was added with the official 1.8 patch. This sets the amount of zoom while riding a dragon.",
  "fOverShoulderDragonPosX": "This was added with the official 1.8 patch. This sets the the camera position along the x-axis (to the right or to the left) in relation to the player character while riding a dragon.",
  "fOverShoulderDragonPosZ": "This was added with the official 1.8 patch. This sets the the camera height in relation to the player character while riding a dragon.",
  "fOverShoulderHorseAddY": "This sets the amount of zoom while riding a horse.",
  "fOverShoulderHorsePosX": "This sets the the camera position along the x-axis (to the right or to the left) in relation to the player character while riding a horse.",
  "fOverShoulderHorsePosZ": "This sets the the camera height in relation to the player character while riding a horse.",
  "fVanityModeMaxDistFlyMult": "This was added with the official 1.8 patch.",
  "fVanityModeMinDistFly": "This was added with the official 1.8 patch.",
  "bRecord": "This is believed to be unused by the game.",
  "sNif": "This is believed to be unused by the game.",
  "sOffsetID": "This is believed to be unused by the game.",
  "fCloudAtlasWidth": "This is believed to be unused by the game.",
  "sCloudInstanceMesh": "This is believed to be unused by the game.",
  "bChainExplosionDebug": "This is believed to be unused by the game.",
  "bDebugCombatAimLocations": "This is believed to be unused by the game.",
  "bDebugCombatArea": "This is believed to be unused by the game.",
  "bDebugCombatAttackRange": "This is believed to be unused by the game.",
  "bDebugCombatCoverReservations": "This is believed to be unused by the game.",
  "bDebugCombatDetection": "This is believed to be unused by the game.",
  "bDebugCombatGroups2": "This is believed to be unused by the game.",
  "bDebugCombatProjectileLOS": "This is believed to be unused by the game.",
  "bDebugCombatSearch": "This is believed to be unused by the game.",
  "bDebugCombatTargetLocations": "This is believed to be unused by the game.",
  "bDebugCombatTargets": "This is believed to be unused by the game.",
  "bDebugCombatTextColorDark": "This is believed to be unused by the game.",
  "bDebugCombatThreats": "This is believed to be unused by the game.",
  "bDebugCombatUnreachableLocations": "This is believed to be unused by the game.",
  "bDisableNPCAttacks": "This is believed to be unused by the game.",
  "bDismemberOneLimb": "This is believed to be unused by the game.",
  "bHazardDebug": "This is believed to be unused by the game.",
  "bMagicDebug": "This is believed to be unused by the game.",
  "bPlayHitLocationIdles": "This is believed to be unused by the game.",
  "bPlayStaggers": "This is believed to be unused by the game.",
  "bProjectileDebug": "This is believed to be unused by the game.",
  "f1PBoltTiltUpAngle": "This was added with the official 1.6 patch, which added Dawnguard compatibility and introduced crossbows.",
  "f3PBoltTiltUpAngle": "This was added with the official 1.6 patch, which added Dawnguard compatibility and introduced crossbows.",
  "fDebugCombatProjectileLOSTime": "This is believed to be unused by the game.",
  "fDebugCombatTextSize": "This is believed to be unused by the game.",
  "fDecapInitialSpeed": "This was added with the official 1.2 patch.",
  "fHitVectorDelay": "This is believed to be unused by the game.",
  "fIronSightsZoomDefault": "This is believed to be unused by the game.",
  "fMountedAttackRange": "This was added with the official 1.6 patch, which introduced mounted combat.",
  "fProjectileDebugDuration": "This is believed to be unused by the game.",
  "iShowHitVector": "This is believed to be unused by the game.",
  "bShowKinectDebugInfo": "This was added with the official 1.6 patch. It probably was a debug setting used when fixing some Kinect issues on XBox that were resolved with the official 1.6 patch.",
  "fDialogueHardStopAngle1P": "This controls how far the camera can be rotated while in first-person conversation mode. Expressed in degrees from the original viewport facing. 180 enables full rotation.",
  "fDialogueHardStopAngle3P": "This controls how far the camera can be rotated while in third-person conversation mode. Expressed in degrees from the player character facing. 180 enables full rotation.",
  "fDialogueSoftStopAngle1P": "This controls how far the camera can be rotated while in first-person conversation mode before it starts \u0022resisting\u0022 further rotation by decreasing the effect the mouse has on the camera. Effectively disabled if set equal to or higher than fDialogueHardStopAngle1P.",
  "fDialogueSoftStopAngle3P": "This controls how far the camera can be rotated while in third-person conversation mode before it starts \u0022resisting\u0022 further rotation by decreasing the effect the mouse has on the camera. Effectively disabled if set equal to or higher than fDialogueHardStopAngle3P.",
  "fGamepadHeadingYScale": "This default value was increased from 0.5 to 23 in the official 1.2 patch.",
  "fPCDialogueLookSpeed": "This controls how quickly the camera can be rotated/pitched while in conversation mode. Affects both first- and third-person.",
  "iNumHotkeys": "This default value was increased from 8 to 37 with the official 1.6 patch.",
  "sCopyProtectionMessage2": "This is believed to be unused by the game.",
  "sCopyProtectionMessage": "This is believed to be unused by the game.",
  "sCopyProtectionTitle2": "This is believed to be unused by the game.",
  "sCopyProtectionTitle": "This is believed to be unused by the game.",
  "bDebugFaceGenCriticalSection": "This is believed to be unused by the game.",
  "bDebugFaceGenMultithreading": "This is believed to be unused by the game.",
  "bDebugFlyingMountLeash": "This is believed to be unused by the game. This was added with the official 1.8 patch.",
  "bAllowDecalsOnAlpha": "This toggles decals on what alpha?",
  "bBackgroundInitializeGeometryDecals": "This toggles the ability of decals on geometry to initialize in the background?",
  "bDecalMultithreaded": "This is believed to be unused by the game.",
  "bDecalOcclusionQuery": "This toggles occlusion query on decals?",
  "bForceAllDecals": "This toggles the ability to force all decals to be displayed? If all other decal settings are set to 0, this setting doesn\u0027t force them to display, so what does this force? Or does it do nothing?",
  "bSkinnedDecals": "This is believed to be unused by the game.",
  "fDebrisDecalTimer": "This sets how long debris possesses decals?",
  "bDecals=1Must": "This be equal to or less than iMaxSkinDecalsPerFrame (located in the Prefs .ini in the [Display] section)Must be equal to or less than uMaxSkinDecals.",
  "bUse": "This Shaders",
  "iLocation": "This X",
  "bAllow20HairShader": "This is believed to be unused by the game. In testing, no difference in the hair was noticed. Since Skyrim requires use of shader model 3.0, it probably is disabled.",
  "bAllow30Shaders": "This is believed to be unused by the game. In testing, no difference was noticed, and it definitely did not turn off shader model 3.0. Since Skyrim requires use of shader model 3.0, it probably is disabled.",
  "bAllowPartialPrecision": "This is believed to be unused by the game.",
  "bAllowScreenShot": "This toggles the ability to create screenshots in BMP format by pressing the PrintScreen key. Once over three megabytes in size, the files seem to become corrupt.",
  "bAutoViewDistance": "This toggles a method of automatically determining how far one can see. Unfortunately, the setting is bugged, and causes distant scenery to flash if enabled.",
  "bCompileOnRender": "This is believed to be unused by the game. This was likely a debug setting targeting shader compilation during development.",
  "bDecalsOnSkinnedGeometry": "This is believed to be unused by the game.",
  "bDo30VFog": "This is believed to be unused by the game. In testing, setting this to 0 produced identical fog appearance to having it enabled. This does not entirely prove that this setting is unused, but merely shows that it does not affect appearance. It possibly toggles shader model 3.0 for fog, but since Skyrim requires use of shader model 3.0, it probably is disabled.",
  "bDoAmbientPass": "This is believed to be unused by the game.",
  "bDoDiffusePass": "This is believed to be unused by the game.",
  "bDoSpecularPass": "This is believed to be unused by the game.",
  "bDoTallGrassEffect": "This is believed to be unused by the game.",
  "bDoTestHDR": "This is believed to be unused by the game. HDR rendering support was dropped in Skyrim.",
  "bDoTexturePass": "This is believed to be unused by the game. In Oblivion this turned textures off, but in Skyrim it seems to do nothing upon testing.",
  "bDynamicWindowReflections": "This is believed to be unused by the game.",
  "bEquippedTorchesCastShadows": "This is believed to be unused by the game.",
  "bForce1XShaders": "This is believed to be unused by the game.",
  "bForceMultiPass": "This is believed to be unused by the game.",
  "bForcePow2Textures": "This probably was a workaround for graphics cards that cannot use textures that were not powers of 2, forcing all textures to become powers of 2. However, the setting merely causes the game to crash upon loading.",
  "bIgnoreResolutionCheck": "This is believed to be unused by the game.",
  "bImageSpaceEffects": "This toggles imagespace effects, which evidently are necessary, since disabling them induces CTD.",
  "bLowHealthIModEnabled": "This toggles the blurring effect that occurs when your health is low.",
  "bMTRendering": "This when enabled does something to the rendering in order to--cause the game to freeze up and not do anything!",
  "bReportBadTangentSpace": "This is believed to be unused by the game. This was likely a debugging setting for reporting wrong tangents on meshes during development.",
  "bShowMenuTextureUse": "This is believed to be unused by the game.",
  "bUseSunbeams": "This is believed to be unused by the game.",
  "fLightLODDefaultStartFade": "This is believed to be unused by the game. In testing, no change was noticed. It is possible that the value for this setting once changed the default value of fLightLODStartFade, but it does not do that anymore, if it ever did.",
  "fLightLODMaxStartFade": "This sets the maximum distance that Light Fade (fLightLODStartFade) can be set to in the in-game Settings \u003E Display menu. It appears to have no actual effect.",
  "fLightLODMinStartFade": "This sets the minimum distance that Light Fade (fLightLODStartFade) can be set to in the in-game Settings \u003E Display menu. It appears to have no actual effect.",
  "fLightLODRange": "This sets how far away light will fade from the start fade distance (fLightLODStartFade, which is Light Fade in the in-game Settings \u003E Display menu). It is recommended to set it to 50000.",
  "fLowHealthIModInterval": "This sets the time interval in half seconds of the blurring effect that occurs when your health is low. Setting it to 0 will cause the blur to be constant.",
  "fLowHealthIModStrengthMax": "This sets the maximum strength of the blurring effect that occurs when your health is low.",
  "fLowHealthIModStrengthMin": "This sets the minimum strength of the blurring effect that occurs when your health is low.",
  "fScopeScissorAmount": "This is believed to be unused by the game.",
  "fShadowFadeTime": "This is believed to be unused by the game. In testing, no difference was noticed. In previous games, this setting set the time in seconds that shadows fade into view, but it appears to be broken in Skyrim.",
  "fShadowLODDefaultStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fShadowLODMaxStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fShadowLODMinStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fShadowLODRange": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fSkinnedDecalLOD0": "This is believed to be unused by the game.",
  "fSpecularLODDefaultStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fSpecularLODMaxStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fSpecularLODMinStartFade": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fSpecularLODRange": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iAdapter": "This sets which screen will display the game in a multi-monitor setup. If it is set incorrectly, it will cause an error saying \u0022Failed to initialize renderer. Bad Adapter Name or Adapter not found.\u0022",
  "iDebugTextSubPage": "This is believed to be unused by the game.",
  "iNPatchNOrder": "This is believed to be unused by the game.",
  "iNPatchPOrder": "This is believed to be unused by the game.",
  "iShaderPackageMemoryCap": "This sets the maximum amount of memory the shader package is allowed to use. Once this limit has been passed, it will stop displaying objects.",
  "sDebugText": "This is believed to be unused by the game.",
  "uVideoDeviceIdentifierPart1": "This is believed to be unused by the game. It is an Oblivion remnant.",
  "uVideoDeviceIdentifierPart2": "This is believed to be unused by the game. It is an Oblivion remnant.",
  "uVideoDeviceIdentifierPart3": "This is believed to be unused by the game. It is an Oblivion remnant.",
  "uVideoDeviceIdentifierPart4": "This is believed to be unused by the game. It is an Oblivion remnant.",
  "sFontConfigFile": "This sets the path to the font configuration file.",
  "bFootPlacementOn": "This is believed to be unused by the game.",
  "bRigidBodyController": "This is believed to be unused by the game.",
  "fMaxFootCastMilliSec": "This is believed to be unused by the game.",
  "fOriginalGroundHeightMS": "This is believed to be unused by the game.",
  "fRagdollFeedback": "This is believed to be unused by the game.",
  "bAllowDragonFlightLocationDiscovery": "This was added with the official 1.8 patch.",
  "bInstantLevelUp": "This is believed to be unused by the game. This appears to be an Oblivion artifact where levelups would not occur until the character slept unless this was enabled.",
  "bTargetLockIsToggle": "This was added with the official 1.8 patch.",
  "bTrackProgress": "This is believed to be unused by the game.",
  "fFootIKDistance": "This is believed to be unused by the game.",
  "fMagicTargetLocationExtraLargeActorRadius": "This was added with the official 1.6 patch, which introduced Dawnguard compatibility. Therefore, this setting is presumed to be related to vampires in some way.",
  "fMagicTargetLocationNormalActorRadius": "This was added with the official 1.6 patch, which introduced Dawnguard compatibility. Therefore, this setting is presumed to be related to vampires in some way.",
  "fPlayerSunGazeDelta": "This was added with the official 1.6 patch, which introduced Dawnguard compatibility. Therefore, this setting is presumed to be related to vampires\u0027 sun allergy.",
  "fPlayerSunGazeStartTimer": "This was added with the official 1.6 patch, which introduced Dawnguard compatibility. Therefore, this setting is presumed to be related to vampires\u0027 sun allergy.",
  "fTargetLockXYRange": "This was added with the official 1.8 patch.",
  "iActorsDismemberedPerFrame": "This is believed to be unused by the game.",
  "iDetectionPicks": "This is believed to be unused by the game.",
  "sTrackProgressPath": "This is believed to be unused by the game. It appears to be a Fallout 3 artifact.",
  "bCreate": "This Maps Enable",
  "uExterior": "This Cell Buffer",
  "uInterior": "This Cell Buffer",
  "bAnimateDoorPhysics": "This may toggle something... but it is uncertain what. In testing, no difference was noticed.",
  "bBackgroundLoadVMData": "This toggles the ability of the game to load Papyrus scripting virtual machine data in the background?",
  "bCRTMemoryChecks": "This is believed to be unused by the game.",
  "bCalculateArmorMeshAndTextureFileCounts": "This is believed to be unused by the game.",
  "bCheckCellOffsetsOnInit": "This is believed to be unused by the game.",
  "bCheckPurgedTextureList": "This is believed to be unused by the game.",
  "bDebugSpectatorThreats": "This is believed to be unused by the game.",
  "bDisableDuplicateReferenceCheck": "This is believed to be unused by the game.",
  "bDisableGearedUp": "This toggles off a bugged feature in Skyrim where all favorite items are shown as equipped and passive on your character. However, if you equip a favorite weapon and them equip another favorite weapon, the first item will become invisible or else become doubly equipped. If the game could be forced to unequip the item before equipping another, this would be a great feature. As is, it is buggy and unuseful except, perhaps, for screen archers.",
  "bEnableBoundingVolumeOcclusion": "This toggles drawing objects that are not directly visible. It is recommended to be left on.",
  "bExternalLODDataFiles": "This is believed to be unused by the game.",
  "bFaceMipMaps": "This is believed to be unused by the game.",
  "bFlyingMountFastTravelCruiseEnabled": "This was added with the official 1.8 patch.",
  "bKeepPluginWhenMerging": "This is believed to be unused by the game.",
  "bParallelAnimUpdate": "This is believed to be unused by the game.",
  "bPreCullActors": "This toggles drawing actors that are not directly visible. It is recommended to be left on.",
  "bRunMiddleLowLevelProcess": "This is believed to be unused by the game.",
  "bRunVTuneTest": "This is believed to be unused by the game.",
  "bShowCheckMemoryOutput": "This is believed to be unused by the game.",
  "bShowGunTarget": "This is believed to be unused by the game.",
  "bTaskletActorSceneGraphUpdates": "This is believed to be unused by the game.",
  "bTintMipMaps": "This is believed to be unused by the game.",
  "bUseEyeEnvMapping": "This is believed to be unused by the game. This may have toggled NPC eye reflections and specular highlights. This worked in Oblivion, but it does not work in Skyrim according to testing.",
  "bUseMyGamesDirectory": "This is believed to be unused by the game. This may have toggled where the game will look for and place the game configuration and load order files. It was an Oblivion tweak, and it seems to have gone to Oblivion, since it does not work in Skyrim according to testing.",
  "bUseOptimizedTextureLoading": "This is believed to be unused by the game.",
  "bUseThreadedMorpher": "This is believed to be unused by the game.",
  "bUseThreadedParticleSystem": "This is believed to be unused by the game.",
  "bUseThreadedTempEffects": "This is believed to be unused by the game.",
  "bWarnOnMissingFileEntry": "This is believed to be unused by the game.",
  "fDragonLandingForPlayerNavMeshSize": "This was added with the official 1.8 patch.",
  "fDragonLandingForPlayerSearchDist": "This was added with the official 1.8 patch.",
  "fFlyingMountDismountOffset": "This was added with the official 1.8 patch.",
  "fFlyingMountFastTravelDragonSpeed": "This was added with the official 1.8 patch.",
  "fFlyingMountLandingRequestTimer": "This was added with the official 1.8 patch.",
  "fFlyingMountSlowestSpeedMult": "This was added with the official 1.8 patch.",
  "fFlyingMountTutorialMessageDelay": "This was added with the official 1.8 patch.",
  "fMasterFilePreLoadMB": "This is believed to be unused by the game.",
  "fPlayerFlyingMountBaseTargetSpeed": "This was added with the official 1.6 patch.",
  "fPlayerFlyingMountFastBaseTargetSpeed": "This was added with the official 1.8 patch.",
  "fPlayerFlyingMountNothingLoadingMult": "This was added with the official 1.8 patch.",
  "fPlayerFlyingMountTravelMaxHeight": "This was added with the official 1.8 patch.",
  "fPlayerFlyingMountTravelMinHeight": "This was added with the official 1.8 patch.",
  "iAIThread1HWThread": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iAIThread2HWThread": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iFPSClamp": "This aligns the FPS of gameplay to that of your actual fps. It makes all game actions happen at a speed of your FPS divided by this value. If you get 60 fps and set this to 2, the game animations and everything will be 30 times as fast as normal, with accompanying bugs. If used, it is best to set it at a little under your current FPS. It is recommended to leave this at its default 0 so that the game speed always is the same speed as your FPS.",
  "iFlyingMountSlowestQueuedRefCount": "This was added with the official 1.8 patch.",
  "iHWThread1": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iHWThread2": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iHWThread3": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iHWThread4": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iHWThread5": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iHWThread6": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iRenderingThread1HWThread": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iRenderingThread2HWThread": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "sCharGenQuest": "This sets the quest id for the starting quest when you begin a new game.",
  "sEssentialFileCacheList": "This is probably is a caching system for essential game data (game data that is necessary for it to function properly). This should be a list of files with each entry separated by commas. An example value found: Data/Skyrim.esm, Data/Skyrim - Meshes.bsa, Data/Skyrim - Textures.bsa, Data/Skyrim - Animations.bsa, Data/Skyrim - Misc.bsa, Data/Skyrim - Shaders.bsa, Data/Skyrim - Interface.bsa, Data/Skyrim - Sounds.bsa",
  "sLocalMasterPath": "This is believed to be unused by the game.",
  "sLocalSavePath": "This sets the subdirectory where your game saves are stored at %USERPROFILE%/Documents/My Games/Skyrim. Changing this can be useful if you decide to organize your saves by character or other means. You could rename the save folder with all the John saves in it to John and change this value to access the John saves and so on. This value cannot be changed to a full path. Mod Organizer automatically overrides this setting when using profile-specific saves.",
  "sStartingCell": "This sets the starting cell for a new game, bypassing the main menu and the main quest startup.",
  "sStartingCellX": "This sets the x-coordinate in the starting cell specified in sStartingCell.",
  "sStartingCellY": "This sets the y-coordinate in the starting cell specified in sStartingCell.",
  "sStartingWorld": "This sets the worldspace of the starting cell specified in sStartingCell.",
  "sTestFile1": "This through This0 are settings that allow loading of plugins without using the standard loading method. Be advised that plugins loaded here will NOT automatically load their corresponding BSA files if they exist. These, however, can be added to the sArchiveList in [Archive].",
  "sUnessentialFileCacheList": "This probably is a caching system for unessential game data (game data that is the game can technically run without). This should be a list of files with each entry separated by commas. An example value found: Data/Skyrim - Voices.bsa, Data/Skyrim - VoicesExtra.bsa",
  "fBlockedTexOffset": "This is believed to be unused by the game.",
  "fBlurAmmount": "This is believed to be unused by the game.",
  "fHitTexOffset": "This is believed to be unused by the game.",
  "bAllowLoadGrass": "This toggles grass loading via the grass cache *.gid files. It is an alternative to creating grass (bAllowCreateGrass). It is typically disabled because the grass cache that comes with the vanilla game is not suitable for the current version, as it was never updated correctly by Bethesda. The SkyrimLE:Unofficial Skyrim Patch plugin INI contains this setting set to disabled.",
  "bDrawShaderGrass": "This toggles the grass shader. Enabling it enables grass, while disabling it will disable grass. It is recommended to be enabled.",
  "bGenerateGrassDataFiles": "This allows the game to create grass cache *.gid files if set to 1. These files can then in turn be loaded via bAllowLoadGrass.",
  "bGrassPointLighting": "This is believed to be unused by the game. In testing, no change was noticed.",
  "fGrassDefaultStartFadeDistance": "This is believed to be unused by the game. In testing, no change was noticed. It is possible that the value for this setting once changed the default value of fGrassStartFadeDistance, but it does not do that anymore, if it ever did.",
  "fGrassFadeRange": "This sets how far away grass will fade from the start fade distance (fGrassStartFadeDistance, which is Grass Fade in the in-game Settings \u003E Display menu). It is recommended to adjust This rather than increase fGrassStartFadeDistance to reduce grass pop-in effect and performance benefits over the latter.",
  "fGrassWindMagnitudeMax": "This sets the maximum amount of wind blowing the grass, making the grass move. Setting fGrassWindMagnitudeMin and This to 0 will cause the grass to remain static and may give better performance.",
  "fGrassWindMagnitudeMin": "This sets the minimum amount of wind blowing the grass, making the grass move. Setting This and fGrassWindMagnitudeMax to 0 will cause the grass to remain static and may give better performance.",
  "fTexturePctThreshold": "This sets the texture percent threshold of the grass. Valid values range between 0 and 0.2, where 0 is full, and 0.2 altogether removes the grass. Negative values act as 0.",
  "fWaveOffsetRange": "This is believed to be unused by the game. In testing, no change was noticed.",
  "iGrassCellRadius": "This sets the radial number of cells that grass is rendered around the player. This must be set to (uGridsToLoad - 1)/2. If set higher, grass will bug out quickly and remove all grass upon walking just a short distance. If set lower, grass will pop into view unrealistically. Negative values disable grass.",
  "iMaxGrassTypesPerTexure": "This (sic) sets the maximum types of grass per texture. Increasing this will create more diverse kinds of grass, especially with grass mods such as Skyrim Flora Overhaul at a small performance cost. Without grass mods, changing this setting produces little effect. Negative values disable grass. t is recommended to increase this from its default 2 to 3. If using Skyrim Flora Overhaul, it is recommended to set this to 7.",
  "bAddBipedWhenKeyframed": "This toggles the ability of all characters to fly and possess all kinds of funky animations. It is recommended to be left disabled. It originated with Oblivion.",
  "bDebugMultithreaded": "This is believed to be unused by the game.",
  "bHavokDebug": "This is believed to be unused by the game. It originated with Oblivion.",
  "bRegisterAllVDBViewers": "This is believed to be unused by the game.",
  "bWONameSync": "This is believed to be unused by the game. It originated with Fallout 3.",
  "fCharControllerWarpDistSqr": "This is believed to be unused by the game. It originated with Fallout 3.",
  "fJumpAnimDelay": "This is believed to be unused by the game. It originated with Oblivion.",
  "fMaxPickTimeDebug": "This is believed to be unused by the game. It originated with Fallout 3.",
  "fMaxPickTimeDebugVATS": "This is believed to be unused by the game. It originated with Fallout 3.",
  "fOD": "This is believed to be unused by the game. It originated with Oblivion.",
  "fRF": "This is believed to be unused by the game. It originated with Oblivion.",
  "fSD": "This is believed to be unused by the game. It originated with Oblivion.",
  "fSE": "This is believed to be unused by the game. It originated with Oblivion.",
  "fTimePerSubStep": "This is believed to be unused by the game. It originated with Fallout 3.",
  "iMinNumSubSteps": "This is believed to be unused by the game. It originated with Fallout 3.",
  "iSimType": "This changes between different methods of havok behavior? It originated with Oblivion.",
  "fHeadTrackingMaxAngle": "This is believed to be unused by the game.",
  "bShowInventory3D": "This toggles the 3D display of items in the inventory.",
  "bWriteTranslationFile": "This is believed to be unused by the game.",
  "fCrafting3DItemPosX": "This is believed to be unused by the game.",
  "fCrafting3DItemPosXWide": "This is believed to be unused by the game.",
  "fCrafting3DItemPosY": "This is believed to be unused by the game.",
  "fCrafting3DItemPosYWide": "This is believed to be unused by the game.",
  "fCrafting3DItemPosZ": "This is believed to be unused by the game.",
  "fCrafting3DItemPosZWide": "This is believed to be unused by the game.",
  "fCrafting3DItemScale": "This is believed to be unused by the game.",
  "fCrafting3DItemScaleWide": "This is believed to be unused by the game.",
  "fPackratRatio": "This default value was changed from 340282346638528860000000000000000000000 to 0 with the official 1.6 patch.",
  "fPlayerRotationAngle": "This is believed to be unused by the game.",
  "fUILogoModel_AutoRotateSpeed": "This is believed to be unused by the game.",
  "fUILogoModel_MouseThreshold": "This is believed to be unused by the game.",
  "fUILogoModel_MouseToPanSpeed": "This is believed to be unused by the game.",
  "fUILogoModel_RotationPauseDuration": "This is believed to be unused by the game.",
  "fUILogoModel_ThumbstickToPanSpeed": "This is believed to be unused by the game.",
  "fUIMistMenu_LogoOnscreenPanThresholdX": "This is believed to be unused by the game.",
  "fUIMistMenu_LogoOnscreenPanThresholdY": "This is believed to be unused by the game.",
  "fUIMistMenu_LogoOnscreenZoomThresholdFar": "This is believed to be unused by the game.",
  "fUIMistMenu_LogoOnscreenZoomThresholdNear": "This is believed to be unused by the game.",
  "sForcedLoadScreenEditorID": "This is believed to be unused by the game.",
  "bCurrentCellOnly": "This is believed to be unused by the game.",
  "sFailureMessage": "This is believed to be unused by the game.",
  "sSysUtil_AutoSaveWarning": "This is believed to be unused by the game.",
  "sSysUtil_AwardsConfiguring": "This is believed to be unused by the game.",
  "sSysUtil_AwardsInstalling": "This is believed to be unused by the game.",
  "sSysUtil_AwardsLoading": "This is believed to be unused by the game.",
  "sSysUtil_AwardsReinstalling": "This is believed to be unused by the game.",
  "sSysUtil_AwardsUpdating": "This is believed to be unused by the game.",
  "sSysUtil_DirtyDisc": "This is believed to be unused by the game.",
  "sSysUtil_DiscEject": "This is believed to be unused by the game.",
  "sSysUtil_GameContentInstalling": "This is believed to be unused by the game.",
  "sSysUtil_GameDataCorrupt": "This is believed to be unused by the game.",
  "sSysUtil_GameDataInsufficientSpace": "This is believed to be unused by the game.",
  "sSysUtil_NPDRMInstalling": "This is believed to be unused by the game.",
  "sSysUtil_Retry": "This is believed to be unused by the game.",
  "sSysUtil_SaveDataCreateNew": "This is believed to be unused by the game.",
  "sSysUtil_SaveDataInsufficientSpace": "This is believed to be unused by the game.",
  "sSysUtil_SaveDataOwnershipWarning": "This is believed to be unused by the game.",
  "fLightEnableDisableFadeTime": "This along with the [Light] section was added in the official 1.6 patch, which introduced Dawnguard compatibility. Therefore, it is presumed to be related to the vampires\u0027 sun allergy.",
  "fDecalLODFadeEnd": "This sets the ending fade for decals. It is recommended to be increased.",
  "fDistanceMultiplier": "This appears to be multiplied against many LOD distance settings.",
  "fLODLandDropAmount": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fLODLandVerticalBias": "This is believed to be unused by the game.",
  "fLODMultTrees": "This is believed to be unused by the game.",
  "fLodDistance": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fTalkingDistance": "This sets the distance away from the player that NPCs can move their lips fully while speaking.",
  "fAngleMax": "This is believed to be unused by the game.",
  "fEyeIKDistanceMax": "This is believed to be unused by the game.",
  "fMaxTrackingDist": "This is believed to be unused by the game.",
  "fMinTrackingDist": "This is believed to be unused by the game.",
  "bEnableLipLookup": "This was added with the official 1.3 patch.",
  "bUseWaterHDR": "This is believed to be unused by the game. In testing, no difference was noticed; besides, Skyrim does not use HDR rendering.",
  "fLowPerfCombatantVoiceDistance": "This is believed to be unused by the game.",
  "iDetectionHighNumPicks": "This is believed to be unused by the game.",
  "iLastHDRSetting": "This is believed to be unused by the game.",
  "bWorldMapNoSkyDepthBlur": "This toggles off the subtle sky depth blur applied to the map menu. It makes very little difference. It is recommended to be set to 1.",
  "fMapMenuNearClipPlane": "This sets the clipping pane for objects near each other. This effectively helps prevent z-fighting on the map menu. A value of 0 causes extreme z-fighting on the map menu. Unfortunately, it doesn\u0027t affect z-fighting elsewhere.",
  "fMapMenuOverlayScale": "This sets the scale of the terrain overlay on the map menu. It is recommended to be very small, but not 0, as 0 looks horrible. The default setting seems to be the best, but experiment with very small values around 0.00009.",
  "fMapMenuOverlaySnowScale": "This sets the scale of the snow overlay on the map menu. It is recommended to be very small, but not 0, as 0 looks horrible.",
  "fMapWorldMaxPitch": "This sets the maximum pitch that the user can change the angle of the map upwards. A value of 90 allows the user to angle the camera perpendicularly to the map while the right mouse button is pressed. A value of 180 will allow the user to look up at the sky overhead. It is recommended to set this to 90.",
  "fMapWorldMinPitch": "This sets the minimum pitch that the user can change the angle of the map downwards. A value of 0 allows the user to angle the camera straight down on the map while the right mouse button is pressed. It is recommended to set this to 0.",
  "fMapWorldYawRange": "This sets the yaw range that the map menu camera can turn when the right mouse button is pressed. Setting this to 400 allows the user to rotate full circle once. Increasing this beyond 400 allows the user to rotate more than full circle. Obsessively high values (e.g., 3600) induce crashes.",
  "fWorldMapDepthBlurScale": "This sets the scale of depth blurring applied to the map menu. It is recommended to be set to 0.",
  "fWorldMapMaximumDepthBlur": "This sets the maximum amount of depth blurring applied to the map menu. It is recommended to be set to 0.",
  "fWorldMapNearDepthBlurScale": "This sets the amount of depth blurring applied to the map menu at higher elevations. It is recommended to be set to 0.",
  "uLockedObjectMapLOD": "This sets the level of detail of objects on the map menu. Lowering this produces better details on objects, especially river falls, but will cause the map to load slightly slower. It has been observed to sometimes cause infinite loading screens when loading saves where it was a higher value. It is recommended to set this to 8.",
  "uLockedTerrainLOD": "This sets the level of detail of the terrain on the map menu. Lowering this produces better details on terrain, but will cause the map to load significantly slower (as in, wait thirty seconds for the map to load). It is therefore NOT recommended to lower this.",
  "iConsoleHistoryCharBufferSize": "This sets the number of characters that are displayed in the history list when using console commands like help. The default setting shows the last 16,384 characters in the history list.",
  "bAllowFileWrite": "This is believed to be unused by the game.",
  "bDisableAssertQueuing": "This is believed to be unused by the game.",
  "bFaceGenWarnings": "This is believed to be unused by the game.",
  "bUseWindowsMessageBox": "This is believed to be unused by the game.",
  "bEnableLogging": "This toggles Papyrus logs being written to disk. It is recommended to be disabled.",
  "bEnableProfiling": "This toggles script profiling, which enables profiling commands and allows profiling information to be logged, at the cost of some script performance. It is recommended to be disabled.",
  "bEnableTrace": "This toggles script tracing. Trace commands will not display in-game if this is disabled. It is recommended to be disabled.",
  "bLoadDebugInformation": "This toggles additional debug information. If enabled, line number information will be available in error traces at the expense of higher memory usage. It is recommended to be disabled.",
  "uTraceStatusOfQuest": "This sets a quest to track for script changes by form ID (converted to decimal). If Papyrus logging is enabled, every time a Papyrus script tries to change something with the quest that this setting specifies, like starting, stopping, setting a stage, or showing an objective, it will log the Papyrus stack trace. It was added with the official 1.6 patch.",
  "bRebuildPathIfSmootherFailed": "This is believed to be unused by the game.",
  "bSlowDownForActorAvoidance": "This is believed to be unused by the game.",
  "bUseAlternateSmoothingForPrime": "This is believed to be unused by the game.",
  "bUseOldPathSmoothing": "This is believed to be unused by the game.",
  "bUsePathSmoothing": "This is believed to be unused by the game.",
  "bUseTaskletsToRecomputeBounds": "This is believed to be unused by the game.",
  "bWarnIfHighLevelSearchFails": "This is believed to be unused by the game.",
  "fAICombatTurnSpeedScale": "This is believed to be unused by the game.",
  "fAITurnSpeedScale": "This is believed to be unused by the game.",
  "fMaxDistanceMoved": "This is believed to be unused by the game.",
  "fMinDist": "This is believed to be unused by the game.",
  "fMinTimeToNextPoint": "This is believed to be unused by the game.",
  "fObstacleUpdateDeltaWhenUnknown": "This is believed to be unused by the game.",
  "fPOVSmootherAvoidNodeCost": "This is believed to be unused by the game.",
  "fPathManagerDebugInfoWindow": "This is believed to be unused by the game.",
  "iMaxPathRequestsPerFrameTracked": "This is believed to be unused by the game.",
  "bLookIK": "This is believed to be unused by the game.",
  "bRagdollFeedback": "This is believed to be unused by the game.",
  "fCameraDist": "This is believed to be unused by the game.",
  "fFeedbackImpulseMult": "This is believed to be unused by the game.",
  "uiFeedbackTimeout": "This is believed to be unused by the game.",
  "bAllowProfileTransfer": "This is believed to be unused by the game.  Interestingly, Google found the following comment about it: \u0022;This should be set to 0 or removed when we ship.\u0022",
  "bAllowScriptedAutosave": "This toggles scripted autosaves.",
  "bCopySaveGameToHostOrMemStick": "This probably is a console setting. It is unknown to do anything on the PC version.",
  "bDisplayMissingContentDialogue": "This toggles the dialogue box that appears when a save is attempted to be loaded when one or more plugins previously used on that save have been removed from the load order.",
  "bOutputSaveGameScreenshot": "This is believed to be unused by the game. This setting, although introduced in Skyrim, appears to do nothing. The title suggests that it would output a screenshot when a game is saved, but no screenshot was observed, and it does not change the built-in screenshot in the save.",
  "bUsePagedBuffers": "This was added in the official patch 1.4. Since the 1.4 changelog says it \u0022Fixed rare crash with loading saved games,\u0022 this addition most likely is the fix for said issue. Therefore, it is recommended to remain enabled.",
  "bUseSaveGameHistory": "This is a mystery setting. It is currently unknown what it might do.",
  "iSaveGameBackupCount": "This sets the number of backup save files with a .bak file extension to save. Each additional backup will have a extra .bak added to the end of it (e.g., if set to 2, there will be two backups for autosave1.ess: autosave1.ess.bak and autosave1.ess.bak.bak). Note that these backups are not identical, which leaves reason to believe that either each backup is generated independently of the original save, or there is some bug in the backup mechanism. Setting this to 0 will create no backups.",
  "sSaveGameGameVersionOutdated": "This was moved from the [MAIN] section to the [SaveGame] section. This message is displayed if a savegame from a newer version of the game that is attempted to be loaded on an older version of the game.",
  "sSaveGameSafeMarkerID": "This is a mystery setting. It is currently unknown what it might do.",
  "fLODSnowThresholdAngle": "This sets the snow level of detail threshold angle on distant terrain and the map menu (i.e., the amount of snow layered on distant mountains). It does not help z-fighting on distant mountains.",
  "bDisplayCloudLOD": "This is believed to be unused by the game.",
  "bKeepLowDetailTerrain": "This is believed to be unused by the game.",
  "bUseNewTerrainSystem": "This toggles the new terrain system. Disabling this will go back to the Oblivion terrain system where terrain fades into view as you approach it rather than getting more detailed as you approach it.",
  "uDistantTreeBlockCacheSizePerCell": "This is believed to be unused by the game.",
  "bFileCheckModelCollision": "This is believed to be unused by the game.",
  "bFileControllerOnRoot": "This is believed to be unused by the game.",
  "bFileGoneMessage": "This is believed to be unused by the game.",
  "bFileNeededMessage": "This is believed to be unused by the game.",
  "bFileShowIcons": "This is believed to be unused by the game.",
  "bFileShowTextures": "This is believed to be unused by the game.",
  "bFileSkipIconChecks": "This is believed to be unused by the game.",
  "bFileSkipModelChecks": "This is believed to be unused by the game.",
  "bFileTestLoad": "This is believed to be unused by the game.",
  "bFileUnusedObject": "This is believed to be unused by the game.",
  "bEnableTreeAnimations": "This toggles the \u0022dynamic\u0022 rendering of trees. If disabled, all trees will be skinned and inanimate, using the \u0022static\u0022 version of tree rendering. It seems to do the same thing as bEnableTrees. See the Skyrim Tree Settings Guide on STEP for more information.",
  "bPickSkinnedTrees": "This is believed to be unused by the game. In testing with multiple different combinations, no difference was noticed.",
  "fUpdateBudget": "This appears to control the amount of resources allocated to tree animations. If set to 0, tree animations will be effectively disabled while not causing all trees to be skinned. See the Skyrim Tree Settings Guide on STEP for more information.",
  "bVATSAllowNoKill": "This toggles the camera animation that zooms in on the target NPC when attacked but not killed. This enables the \u0022kill cam\u0022 effect even when the target NPC is not hit or killed. Set this to 0 disable or 1 to enable the camera animation when attacking NPCs. This was added with the official 1.5 patch. Since the changelog states that it added \u0022New cinematic kill cameras for projectile weapons and spells,\u0022 this setting is presumed to be associated with that.",
  "bVATSDisable": "This toggles the camera animation that zooms in on the target NPC when killed. Set this to 0 to enable or 1 to disable the camera animation when the target NPC is killed.",
  "bVATSForceRanged": "This was added with the official 1.5 patch. Since the changelog states that it added \u0022New cinematic kill cameras for projectile weapons and spells,\u0022 this setting is presumed to be associated with that.",
  "bVATSIgnoreProjectileTest": "This was added with the official 1.5 patch. Since the changelog states that it added \u0022New cinematic kill cameras for projectile weapons and spells,\u0022 this setting is presumed to be associated with that.",
  "bVATSMultipleCombatants": "This toggles the camera animation that zooms in on the target NPC when attacked or killed and multiple combatants are present. Set this to 0 to disable or 1 to enable the camera animation when multiple combatants are present. This was added with the official 1.5 patch. Since the changelog states that it added \u0022New cinematic kill cameras for projectile weapons and spells,\u0022 this setting is presumed to be associated with that.",
  "bVATSRangedSelective": "This was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "bVATSSmartCameraCheckDebug": "This is believed to be unused by the game.",
  "fVATSCastingAfterKillDelay": "This was added with the official 1.5 patch. Since the changelog states that it added \u0022New cinematic kill cameras for projectile weapons and spells,\u0022 this setting is presumed to be associated with that.",
  "fVATSFocus": "This is believed to be unused by the game.",
  "fVATSRangedLowHealthPercent": "This was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "fVATSRangedPercentMin": "This sets the minimum percentage the camera zoom effect is shown in ranged attacks when not sneaking. The default value of 50 means the camera zoom effect is shown in 50% of attacks that kill the target NPC. This was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "fVATARangedPercentSneakKills": "This sets the percentage the camera zoom effect is shown in ranged attacks when sneaking. The default value of 20 means the camera zoom effect is shown in 20% of attacks that kill the target NPC. fVATSRangedPercentSneakKill was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "fVATSRangePercentTargetNoThreat": "This sets the percentage the camera zoom effect is shown in ranged attacks when the target NPC is not a threat. fVATSRangedPercentTargetNoThreat was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "fVATSRangedTargetLowLevelMult": "This was added with the official 1.6 patch, which refined the logic of kill moves, resolving a number of issues.",
  "sFileTypeGame": "This is believed to be unused by the game. It probably would set the filetype for voice files, default being wav files. In previous game, other types like mp3 have been used. Setting it to mp3 does not remove voices.",
  "sFileTypeLTF": "This is believed to be unused by the game.",
  "sFileTypeLip": "This is believed to be unused by the game.",
  "sFileTypeSource": "This is believed to be unused by the game.",
  "bForceLowDetailWater": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "bReflectExplosions": "This is believed to be unused by the game. In testing, it was found that a firebolt was reflected across the water regardless of this setting.",
  "bReflectLODObjects": "This toggles object reflections in the water. It is recommended to be enabled.",
  "bReflectLODTrees": "This toggles tree reflections in the water. It is recommended to be enabled.",
  "bUseCubeMapReflections": "This toggles cube map reflections, and much more! Disabling this will effectively make water invisible unless the player is swimming underneath it. It is recommended to be enabled.",
  "bUsePerWorldSpaceWaterNoise": "This toggles water noise. It is recommended to be enabled.",
  "bUseWaterLOD": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "bUseWaterReflectionBlur": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "bUseWaterShader": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fCubeMapRefreshRate": "This sets the refresh rate of cube map reflections in seconds. If set to 60, water reflections will be calculated only once every minute. This will cause the reflections not to show for the first minute, after which they will pop into place. It is recommended to leave this at 0 so that reflections are calculated in realtime.",
  "fExteriorWaterReflectionThreshold": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fInteriorWaterReflectionThreshold": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fRefractionWaterPlaneBias": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fSurfaceTileSize": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fTileTextureDivisor": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fWadingWaterQuadSize": "This sets the size of the displacement of water created when wading through water. It is recommended to be left at its default value.",
  "fWadingWaterTextureRes": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "fWaterGroupHeightRange": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iWaterBlurAmount": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "iWaterNoiseResolution": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "sSurfaceTexture": "This is believed to be unused by the game. In testing, no change was observed when a random string was entered. This appears to be a remnant from Oblivion.",
  "uMaxExteriorWaterReflections": "This is believed to be unused by the game. In testing, setting this to 0 did not disable water reflections outdoors.",
  "uMaxInteriorWaterReflections": "This is believed to be unused by the game. In testing, setting this to 0 did not disable water reflections indoors.",
  "uSurfaceFPS": "This is believed to be unused by the game. In testing, no change in the smoothness of the water was observed. This appears to be a remnant from Oblivion.",
  "fAlphaReduce": "This is believed to be unused by the game. In testing, no difference was noticed.",
  "sBumpFadeColor": "This is believed to be unused by the game.",
  "sEnvReduceColor": "This is believed to be unused by the game.",
  "sLerpCloseColor": "This is believed to be unused by the game.",
  "fAudioVolumeMusic": "Music volume. 0 = off, 1 = max. Set anywhere in between",
  "fFilmGrainIntensity": "This will set the amount of film grain. 0 = off, 1 = max. Set anywhere in between",
  "bHasUserAccepted": "This will either hide or show the EULA at the main menu. Set to 1 to accept",
  "bEnableMotionBlur": "This will enable or disable motion blur. 1 = on, 0 = off",
  "fCASSharpnessValue": "This Sets the sharpness leven of CAS. 0 = 0% 1 =  100%, anywhere in between is ok",
  "fFPWorldFOV": "This changes the first person Field of View",
  "fTPWorldFOV": "Third Person Field of View",
  "iBackgroundOpacity": "Sets background opacity for the console",
  "fQCZKeyDelay": "Delay in seconds before the player grabs an interactive object.",
  "bTemporalAA_idTech7": "Used to disable TAA. 1 = On 0 = Off",
  "bEnableMessageOfTheDay": "Used to disable the MOTD section on the main menu. 0 = off 1 = On",
  "bPilotCameraShakerEnabled": "Disables camera shake when boosting your ship. 0 = off 1 = On",
  "fDialogueCameraFailsafeFPFOV": "Dialogue Camera First Person Field of View",
  "fFarCameraDistanceOffset": "Maximum distance the camera can be pulled back in 3rd person perspective",
  "bEnableStarsOnPlanet": "1= Stars visible in skybox on planet, 0= Stars not visible in skybox on planet.",
  "bBudgetEnabled": "Whether or not outposts have a build budget. 1 for build limit, 0 for unlimited building (no budget).",
  "fBudgetBaseCost": "Multiplier for outpost building budget cost.",
  "fBudgetBaseline": "Outpost building budget, if enabled. See bBudgetEnabled.",
  "fMaxAnisotropy": "Anistropic filtering multiplier. Set it to 16 to greatly improve oblique texture quality with almost no performance impact.  In particular, it makes planet surfaces look MUCH more detailed",
  "fResourceVeinOpenDuration": "How long it takes for resource veins to close",
  "fResourceVeinCloseDuration": "How long it takes for resource veins to close",
  "bStarMapEnableBodiesScanlines": "Enable to display a scnaline effect over the starmap UI",
  "bStarMapEnableLifeIcon": "Display a life icon (a leaf) on Starmap near planets likely to harbor life.",
  "bStarMapGravityWavesEnableNoise": "Set if a noise is applied on Starmap gravity waves",
  "fMouseHeadingSensitivityMin": "Sets the minimum sensitivity value of the in-game mouse sensitivity slider.",
  "fMouseHeadingSensitivityMax": "Sets the maximum sensitivity value of the in-game mouse sensitivity slider.",
  "bEnableDialogueLight": "Enable or disable the light cast on npcs face when a dialogue is triggered",
  "bDialogueLightRemoveNoMatch": "Turns on/off the dialogue light camera. 1 = ON 0 = OFF",
  "fShipBuilderModuleOverlapTolerance": "Overlap Tolerance for Ship Parts in Build Mode",
  "uLandingKeepBufferSize": "This is the maximum number of your recent landing sites that will be remembered by the system. The actual amount is the value+1, so a value of 9 would cause the system to keep track of your last 10 landing spots.",
  "fDefaultShipAutoVanityZoomScale": "Ship idle camera distance",
  "bUsePressAndHoldControls": "0: Boostpack has a set amount of duration. 1: Boostpack starts\\stops by holding\\releasing space.",
  "fZeroGBoostDrainInitial": "Amount of fuel drained on first press",
  "fZeroGBoostDrainSustained": "Amount of fuel drained while holding space",
  "fZeroGBoostMinFuelRequired": "Minimum amount of fuel needed to activate boost",
  "fZeroGBoostTimeToSustained": "Time from fZeroGBoostDrainInitial to fZeroGBoostDrainSustained",
  "fStarMapGalaxyRotationMaxYaw": "Distance your able to rotate the galxay starmap on the x axis. 45-180 works well",
  "fStarMapGalaxyRotationMaxPitch": "Distance your able to rotate the galxay starmap on the Y axis. 30-85 works well.",
  "fStarMapGalaxyCameraYaw": "The angle/degress the camera is positioned on the X(yaw) axis while looking at Galaxy StarMap. Can help offset the default to be able to see slightly better. 130-170 seems good.",
  "fStarMapGalaxyCameraPitch": "The angle/degress the camera is positioned on the Y(Pitch) axis while looking at Galaxy StarMap. Can help offset the default to be able to see slightly better. 0 Is what I have used but -20 - 20 should be good.",
  "fStarMapGalaxyCameraDefaultFOV": "Field of View for Galaxy StarMap View"
}
